#!/bin/bash


#  Для запуску з параметрами використовуйте формат:
#            ___   ./scan.sh 200 png   __

# доступні формати: pnm|tiff|png|jpeg|pdf
#
# доступні розширення: 75|100|150|200|300|600


#вкажіть шлях для збереження відсканованих файлів
save_path="/home/chameleon/scanner"


# Перевірка наявності параметра --help або --h або --info
if [[ "$1" == "--help" || "$1" == "--h" || "$1" == "--info" ]]; then
	    # Вивід інструкцій та завершення виконання
echo "  Скрипт для сканування 

Його можна запустити за параметрами:

 Перший параметр - роздільна здатність
доступні варіанти 75|100|150|200|300|600

 Другий параметр - формат
доступні формати: pnm|tiff|png|jpeg|pdf 

Відсканований файл з'явиться в $save_path, його можна змінити в змінній
*Якщо не передавати параметрів, скрипт їх запитає
*Потрібно передавати або 2 параметри або жодного

приклад запуску 'scan.sh 150 pdf'
"
   exit 0
fi

# Перевірка наявності аргументів у командному рядку
if [ "$#" -eq 2 ]; then
	    resolution="$1"
	        format="$2"
	else
# Зчитування введених користувачем значень
read -p "Вкажіть бажаний DPI або пропустіть (за замовчуванням 150) 
доступні: 75|100|150|200|300|600 
  >> " resolution
read -p "Оберіть формат або пропустіть (за замовчуванням PDF)
доступні: pnm|tiff|png|jpeg|pdf
  >> " format
fi

# Встановлення значень за замовчуванням, якщо користувач нічого не ввів

#[ -z "$resolution" ] && echo "Значення DPI використовується: 150"
 resolution="${resolution:-150}"
#[ -z "$format" ] && echo "Формат не введено. Використовується: pdf"
 format="${format:-pdf}"

# Перевірка правильності введених значень
case $resolution in
	    75|100|150|200|300|600)
		            ;;
			        *)
	echo "Неправильна роздільна здатність! Виберіть одну з варіантів: 75|100|150|200|300|600"
		exit 1
		        ;;
esac
case $format in
		    pnm|tiff|png|jpeg|pdf)
	            ;;
	        *)
        echo "Неправильний формат! Виберіть один з варіантів: pnm|tiff|png|jpeg|pdf"
	        exit 1
		        ;;
esac
# Вивід повідомлення про початок сканування
echo "Починаю сканування в формат $format з DPI $resolution"

# Перевірка формату і виконання відповідних дій
if [ "$format" != "pdf" ]; then
# Сканування у вказаному форматі
		        scanimage --resolution $resolution --format $format > "$save_path/scan_$(date +'%Y%m%d_%H%M%S').$format"
			else
# Сканування у форматі pnm та конвертація
				scanimage --resolution $resolution --format=pnm | convert pnm:- "$save_path/scan_$(date +'%Y%m%d_%H%M%S').pdf"
			 fi

echo "Сканування завершено."

# Запит на відкриття файлового менеджера
read -p "Відкрити теку? (y/n) " open_option

# Перевірка вибору користувача та відкриття файлового менеджера, якщо вибрано "y"
if [ "$open_option" = "y" ]; then
	    mc "$save_path"
    fi
echo "Збережено в $save_path"
